In [1]:
import pandas as pd
import numpy as np
%matplotlib inline
import matplotlib.pyplot as plt # graficos 
import seaborn as sns # estadistica y visualizacion
#!pip install pandas

In [23]:
lista = [1, 1.5, 3, 4.3, 8.2]

In [24]:
rnames = ["lunes", "martes", "miercoles", "jueves",  "friday"]
cnames = {"long_pata"}
df1 = pd.DataFrame(lista, rnames, cnames)
df1

           long_pata
lunes            1.0
martes           1.5
miercoles        3.0
jueves           4.3
friday           8.2

In [6]:
df1.shape

(5, 1)

In [11]:
df = sns.load_dataset('iris')
df.shape

(150, 5)

In [13]:
df1.mean()  #sacar la media

long_pata    3.6
dtype: float64

In [14]:
df.mean()

C:\Users\HP\AppData\Local\Temp/ipykernel_7996/3698961737.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.mean()

sepal_length    5.843333
sepal_width     3.057333
petal_length    3.758000
petal_width     1.199333
dtype: float64

In [15]:
df1["long_pata"].mean()

3.6

In [17]:
df["sepal_width"].mean() #para sacar la media

3.057333333333334

In [26]:
df1.describe()   #data fictisia

       long_pata
count   5.000000
mean    3.600000
std     2.880104
min     1.000000
25%     1.500000
50%     3.000000
75%     4.300000
max     8.200000

In [27]:
df.describe()   #data iris

       sepal_length  sepal_width  petal_length  petal_width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.057333      3.758000     1.199333
std        0.828066     0.435866      1.765298     0.762238
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

# para crear data

In [29]:
# Crear la data
df2 = pd.DataFrame({'a' : [2,3,4,5,6],
                    'b' : [3,1,9,12,2],
                    'c' : [5.0, 7.4, 4.2, 10.8, 2.3],
                    'd' : pd.Categorical(['caballo', 'gato', 'perro', 'tortuga', 'conejo']),
                    'e' : [13, 11, None, None, 9]}, index=["a", "b", "c", "d", "e"])
df2

   a   b     c        d     e
a  2   3   5.0  caballo  13.0
b  3   1   7.4     gato  11.0
c  4   9   4.2    perro   NaN
d  5  12  10.8  tortuga   NaN
e  6   2   2.3   conejo   9.0

In [31]:
a = [2,3,4,5,6],
b = [3,1,9,12,2],
c = [5.0, 7.4, 4.2, 10.8, 2.3],
d = pd.Categorical(['caballo', 'gato', 'perro', 'tortuga', 'conejo']),
e = [13, 11, None, None, 9], index=["a", "b", "c", "d", "e"]
index=["a", "b", "c", "d", "e"]

SyntaxError: cannot assign to literal (Temp/ipykernel_7996/3241414659.py, line 5)

In [33]:
for i in range(5):
    a = "Hola" +str(i)
    print(i+1, a)

1 Hola0
2 Hola1
3 Hola2
4 Hola3
5 Hola4

In [34]:
df2["c"].std()

3.2753625753494835

In [35]:
df2.describe()

              a          b          c     e
count  5.000000   5.000000   5.000000   3.0
mean   4.000000   5.400000   5.940000  11.0
std    1.581139   4.827007   3.275363   2.0
min    2.000000   1.000000   2.300000   9.0
25%    3.000000   2.000000   4.200000  10.0
50%    4.000000   3.000000   5.000000  11.0
75%    5.000000   9.000000   7.400000  12.0
max    6.000000  12.000000  10.800000  13.0

In [36]:
df2

   a   b     c        d     e
a  2   3   5.0  caballo  13.0
b  3   1   7.4     gato  11.0
c  4   9   4.2    perro   NaN
d  5  12  10.8  tortuga   NaN
e  6   2   2.3   conejo   9.0

In [37]:
df2.iloc[2, 3]

'perro'

In [39]:
df2.iloc[3,1]

12

In [38]:
df2.iloc[:3,:1]  #seleciona rtodos ;los elementos hasta el indice 3 en filas y todo en indices filas en colemnas

   a
a  2
b  3
c  4

In [40]:
df2.iloc[1:4,2:4]

      c        d
b   7.4     gato
c   4.2    perro
d  10.8  tortuga

In [41]:
df2.iloc[3:,2:]

      c        d    e
d  10.8  tortuga  NaN
e   2.3   conejo  9.0

In [42]:
# Todas las columnas
for i in range(0, len(df2.columns)):
    print(df2.iloc[:,i].count())

5
5
5
5
3

In [45]:
# Indices de fila y nombres de columna
print(df1.index)
print(df1.columns)

Index(['lunes', 'martes', 'miercoles', 'jueves', 'friday'], dtype='object')
Index(['long_pata'], dtype='object')

In [50]:
# Renombrar columnas
df2.columns = ['longitud', 'ancho', 'masa', 'nombre_comun', 'observaciones']
df2.index = ["a1", "a2", "b1", "b2", "c1"]
print(df2.columns.tolist()[:])
print(df2)

['longitud', 'ancho', 'masa', 'nombre_comun', 'observaciones']
    longitud  ancho  masa nombre_comun  observaciones
a1         2      3   5.0      caballo           13.0
a2         3      1   7.4         gato           11.0
b1         4      9   4.2        perro            NaN
b2         5     12  10.8      tortuga            NaN
c1         6      2   2.3       conejo            9.0

# data import

In [51]:
pd.read_csv

<function pandas.io.parsers.readers.read_csv(filepath_or_buffer: 'FilePathOrBuffer', sep=<no_default>, delimiter=None, header='infer', names=<no_default>, index_col=None, usecols=None, squeeze=False, prefix=<no_default>, mangle_dupe_cols=True, dtype: 'DtypeArg | None' = None, engine=None, converters=None, true_values=None, false_values=None, skipinitialspace=False, skiprows=None, skipfooter=0, nrows=None, na_values=None, keep_default_na=True, na_filter=True, verbose=False, skip_blank_lines=True, parse_dates=False, infer_datetime_format=False, keep_date_col=False, date_parser=None, dayfirst=False, cache_dates=True, iterator=False, chunksize=None, compression='infer', thousands=None, decimal: 'str' = '.', lineterminator=None, quotechar='"', quoting=0, doublequote=True, escapechar=None, comment=None, encoding=None, encoding_errors: 'str | None' = 'strict', dialect=None, error_bad_lines=None, warn_bad_lines=None, on_bad_lines=None, delim_whitespace=False, low_memory=True, memory_map=False, float_precision=None, storage_options: 'StorageOptions' = None)>

# filtrado de imformacion